---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.Insert(Autodesk.Revit.DB.Reference,System.Int32)
source: html/568037d6-1136-3a97-411a-d870007e0585.htm
---
# Autodesk.Revit.DB.ReferenceArray.Insert Method

Insert the specified reference into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Reference item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Reference`) - The reference to be inserted into the array.
- **index** (`System.Int32`) - The reference will be inserted before this index.

## Returns
Returns whether the reference was inserted into the array.